{
  "TextContent": {
    "Home": {
      "genericaHealth": "Generica Health",
      "medicare": "Medicare",
      "medicareMessage": "Quality care, affordable coverage, Medicare has you covered.",
      "medicaid": "Medicaid",
      "medicaidMessage": "Affordable care and stronger communities, Medicaid makes it possible.",
      "ifp": "Individual And Family Plan",
      "ifpMessage": "Flexible health coverage, built for you and your family.",
      "otherServices": "Other Services",
      "behavioralHealth": "Behavioral Health",
      "dentalHealth": "Dental Health",
      "visionHealth": "Vision Health",
      "physicalHealth": "Physical Health"
    },
    "Footer": {
      "copyRight": " Generica Health. All rights reserved.",
      "privacy": "Privacy Policy",
      "terms": "Terms of Service",
      "disclaimer": "This is NOT an official medical website. This is a portfolio project to show a fictional product and should not be used for medical purposes. The creator of Generica Health is not responsible for any medical decisions you choose to make. ALWAYS consult with your healthcare provider for healthcare products that might benefit you and your loved ones."
    },
    "Privacy": {
      "privacyPolicy": "Privacy Policy",
      "effectiveDate": "Effective Date: ",
      "januaryFirst": "January 1st, 2025",
      "welcome": "Welcome to Generica Health. Your privacy is important to us. This Privacy Policy explains our practices regarding data collection and usage.",
      "collectingInfo": "1. Information We Collect",
      "noInfoCollection": "Generica Health does not collect, store, or process any personal data. All information displayed on our website is hardcoded and not user-generated.",
      "usingInfo": "2. How We Use Your Information",
      "noInfoUsage": "Since we do not collect any personal data, we do not use or process any user information. Our website serves static content for informational purposes only.",
      "sharingInfo": "3. How We Share Your Information",
      "noInfoSharing": "We do not share any user data, as we do not collect any personal information.",
      "dataSecurity": "4. Data Security",
      "dataSecurityImplementation": "Although we do not store user data, we implement security measures to ensure the integrity of our website and prevent unauthorized access or modifications.",
      "yourRights": "5. Your Rights and Choices",
      "noDataCollection": "As we do not collect personal data, there are no user rights related to data access, modification, or deletion.",
      "thirdPartyLinks": "6. Third-Party Links",
      "thirdPartyWebsites": "Our website may contain links to third-party websites. We are not responsible for the privacy practices of those websites and encourage you to review their privacy policies.",
      "changesToPrivacyPolicy": "7. Changes to This Privacy Policy",
      "privacyPolicyUpdates": "We may update this Privacy Policy from time to time. Any changes will be posted on this page with the updated effective date.",
      "genericaHealth": "Generica Health",
      "thankYou": "Thank you for visiting Generica Health."
    },
    "Terms": {
      "termsOfService": "Terms of Service",
      "effectiveDate": "Effective Date: ",
      "januaryFirst": "January 1st, 2025",
      "welcome": "Welcome to Generica Health. By using our website, you agree to the following terms and conditions. If you do not agree, please do not use our site.",
      "websiteUsage": "1. Use of the Website",
      "onlyInfoContent": "Generica Health provides informational content only. It does not offer medical advice, diagnosis, or treatment.",
      "accuracyNotGuaranteed": "Your use of this website is at your own risk. We do not guarantee the accuracy, completeness, or reliability of the content.",
      "noUlawfulThings": "You agree not to use this website for any unlawful or prohibited purpose.",
      "noMedAdvice": "2. No Medical Advice",
      "generalInfoOnly": "The content on this website is for general informational purposes only and should not be used as a substitute for professional medical advice.",
      "healthProviderAdvice": "Always seek advice from a qualified healthcare provider before making medical decisions.",
      "intellectualProperty": "3. Intellectual Property",
      "publicStockImages": "The website uses publicly available stock images and information sourced from the web and AI-generated content.",
      "noThirdPartyOwnership": "Generica Health does not claim ownership of third-party images or information but respects copyright and attribution requirements where applicable.",
      "propertyRightInfringement": "If you believe any content infringes on intellectual property rights, please contact us for review and removal if necessary.",
      "limitiationOfLiability": "4. Limitation of Liability",
      "notRespForUseOfWebsite": "Generica Health is not responsible for any direct, indirect, incidental, or consequential damages arising from your use of this website.",
      "noInterruptionsGuaranteed": "We do not warrant that the website will be uninterrupted, error-free, or free of harmful components.",
      "thirdPartyLinks": "5. Third-Party Links",
      "mayContain3rdParty": "Our website may contain links to third-party websites for convenience.",
      "noRespEndorsement": "We do not endorse or take responsibility for the content, privacy policies, or practices of third-party sites.",
      "changeOfTerms": "6. Changes to Terms",
      "mayUpdateTerms": "We may update these Terms of Service at any time without prior notice.",
      "updateTermAcc": "Continued use of the website after changes are posted constitutes acceptance of the updated terms.",
      "governingLaw": "7. Governing Law",
      "interpretedTerms": "These terms shall be governed by and interpreted in accordance with the laws of The United States Of America."
    },
    "Ifp": {
      "ifpTitle": "Individual And Family Plan",
      "findPlans": "Find plans near me:",
      "whatIsIfp": "What is IFP?",
      "ifpDefinition": "IFP stands for Individual and Family Plan, and it is a health insurance plan purchased by individuals or families, typically through:",
      "healthInsMarketplace": "The health insurance marketplace (established by the Affordable Care Act)",
      "DirFromPriInsProv": "Directly from private insurance providers",
      "plansDesigned": "These plans are designed for people who don't have access to employer-sponsored health coverage and provide essential health benefits like doctor visits, hospitalization, prescription drugs, and preventive care.",
      "whosEligible": "Who's eligible?",
      "ifpWithoutEmployer": "Individuals and families without employer sponsored health insurance. Accessible to self-employed individuals, part-time workers, or early retirees.",
      "whatDoesItCover": "What does it cover?",
      "ifpEssentialHealth": "IFPs cover essential health benefits, including:",
      "doctorVisits": "Doctor visits (primary care and specialists)",
      "HosAndEmerCare": "Hospitalization and emergency care",
      "prescriptionDrugs": "Prescription drugs",
      "preventiveCare": "Preventive care (e.g., vaccinations, screenings)",
      "MatAndNewBornCare": "Maternity and newborn care",
      "MentalHealthServices": "Mental health services",
      "pediatricServices": "Pediatric services (including vision and dental for children)",
      "ifpPlanOptions": "What are some plans that IFP offers?",
      "planCategories": "Plans are categorized based on cost-sharing:",
      "bronze": "Bronze: Lower monthly premiums, higher out-of-pocket costs",
      "silver": "Silver: Moderate premiums and out-of-pocket costs",
      "gold": "Gold: Higher premiums, lower out-of-pocket expenses",
      "platinum": "Platinum: Highest premiums, lowest out-of-pocket expenses",
      "personalCost": "How much will it cost me?",
      "costsVary": "Costs vary depending on:",
      "age": "Age",
      "location": "Location",
      "tobaccoUse": "Tobacco use",
      "planCategory": "Plan category",
      "peopleCovered": "Number of people covered",
      "whenCanIEnroll": "When can I enroll?",
      "twoTypesEnrollment": "There's two types of enrollment:",
      "openEnrollment": "Open Enrollment: Occurs annually, typically in the fall",
      "specialEnrollment": "Special Enrollment: Available after qualifying life events (e.g., marriage, birth, job loss)",
      "benefitsOfIfp": "What are some benifits of IFPs?",
      "customizablePlans": "Customizable plans tailored to your healthcare needs",
      "networkOptions": "Nationwide or regional provider network options",
      "comprehensiveCoverage": "Peace of mind with comprehensive coverage",
      "howCanIqualify": "How can I qualify for it?",
      "financialAssistance": "Many people qualify for financial assistance through tax credits or cost-sharing reductions if they purchase through the Marketplace."
    },
    "Medicare": {
      "medicare": "Medicare",
      "findPlans": "Find plans near me:",
      "whatIsMedicare": "What is Medicare?",
      "medicareDescription": "Medicare is a federal health insurance program primarily designed for people aged 65 and older. It also covers certain younger individuals with disabilities or specific health conditions like End-Stage Renal Disease. Medicare provides essential health coverage and is made up of different parts to help cover various aspects of healtchare. These are:",
      "medicarePartA": "Medicare Part A (Hospital Insurance)",
      "coversInpatient": "Covers inpatient hospital care, skilled nursing facility care, hospice, and some home health services.",
      "mostDontPay": "Most people don't pay a premium for Part A if they or their spouse paid Medicare taxes while working.",
      "medicarePartB": "Medicare Part B (Medical Insurance)",
      "coversOutpatient": "Covers outpatient care, doctor visits, preventive services (like screenings and vaccinations), and certain home health services.",
      "partBRequirements": "Part B requires a monthly premium.",
      "medicarePartC": "Medicare Part C (Medicare Advantage)",
      "offeredPrivateIns": "Offered through private insurance companies approved by Medicare.",
      "combinesPartAandB": "Combines coverage from Part A and Part B, and often includes additional benefits like prescription drugs, vision, and dental care.",
      "plansVary": "Plans can vary, but many offer lower out-of-pocket costs and more coverage options.",
      "medicarePartD": "Medicare Part D",
      "helpsCoverCost": "Helps cover the cost of prescription medications.",
      "privateInsAvailability": "Available through private insurers and can be added to Original Medicare (Parts A and B) or included in a Medicare Advantage plan (Part C).",
      "medicarePrivateDifference": "What's the difference between Medicare and a private health insurance?",
      "twoDifferences": "There's two main differences:",
      "eligibility": "Eligibility",
      "medicareAvailability": "Unlike private health insurance, Medicare is available regardless of income but is typically for seniors (65+) or those with certain disabilities.",
      "coverage": "Coverage",
      "standardizedMedicare": "Medicare is standardized by the federal government, whereas private insurance plans can offer a wider range of options and may require additional premiums, copayments, and deductibles.",
      "additionalInformation": "Some additional information",
      "medigap": "Medigap",
      "fillingGaps": "Private insurance that helps fill the gaps in Medicare coverage (e.g., out-of-pocket costs like copayments, coinsurance, and deductibles).",
      "costs": "Costs",
      "medicareManyServices": "While Medicare covers many services, it doesn't pay for everything. Beneficiaries may still have out-of-pocket expenses, including premiums, deductibles, and copayments, depending on the plan."
    },
    "Medicaid": {
      "medicaid": "Medicaid",
      "findPlans": "Find plans near me:",
      "whatisMedicaid": "What is Medicaid?",
      "medicaidDescription": "Medicaid is a joint federal and state health insurance program designed to provide free or low-cost healthcare to low-income individuals and families. Unlike Medicare, which is mainly for seniors, Medicaid covers a broader range of people, including children, pregnant women, elderly individuals, and people with disabilities.",
      "medicaidFeatures": "Key Features of Medicaid:",
      "eligibility": "Eligibility:",
      "incomeHouseBased": "Based on income and household size, typically determined by the Federal Poverty Level (FPL).",
      "lowIncomeAdults": "Includes low-income adults, children (CHIP), pregnant women, elderly individuals, and people with disabilities.",
      "medicaidExpansion": "Some states have expanded Medicaid under the Affordable Care Act (ACA) to cover more low-income adults.",
      "coverage": "Coverage:",
      "compHealthBenefits": "Medicaid provides comprehensive health benefits, including:",
      "doctorVisits": "Doctor visits and hospital care",
      "prescriptionDrugs": "Prescription Drugs",
      "preventiveServices": "Preventive services (vaccines, screenings)",
      "MatAndNewBornCare": "Maternity and newborn care",
      "menHSubsAbuse": "Mental health and substance abuse treatment",
      "longTermCare": "Long-term care (including nursing home services)",
      "cost": "Cost:",
      "noCostEnrollees": "Minimal or no costs for enrollees (some may have small copays, depending on the state).",
      "federalAndStateFunded": "Funded by both federal and state governments, with each state managing its own program within federal guidelines.",
      "stateSpecificPrograms": "State-Specific Programs:",
      "medicaidBenefits": "Medicaid benefits and eligibility rules vary by state.",
      "additionalBenefits": "Some states have additional benefits, such as dental and vision coverage.",
      "enrollment": "Enrollment:",
      "yearRoundAvailability": "Available year-round (unlike Medicare or private insurance, which have specific enrollment periods).",
      "statesMedicaidApplication": "People can apply through their state's Medicaid office or the Health Insurance Marketplace.",
      "medicaidVsMedicare": "Medicaid vs. Medicare: What's the Difference?",
      "feature": "Feature",
      "medicare": "Medicare",
      "whoQualifies": "Who Qualifies?",
      "lowIncomeIndFam": "Low-income individuals & families",
      "seniorsAndYoungDis": "Seniors (65+), some younger people with disabilities",
      "howItsFunded": "How It's Funded?",
      "fedAndStateGov": "Federal & state governments",
      "federalGovernment": "Federal government",
      "costsQ": "Costs?",
      "freeOrLowCost": "Free or low-cost",
      "somePremiums": "Some premiums, deductibles, and copays",
      "coverageQ": "Coverage?",
      "longTermIncluded": "Varies by state, includes long-term care",
      "standardized": "Standardized, but gaps may require additional plans (Medigap, Part D)"
    },
    "Brokers": {
      "brokers": "Brokers",
      "healthcareBrokers": "healthcare for Brokers",
      "partnerWithClients": "Partner with us to offer your clients the best in health insurance. Our comprehensive plans, competitive rates, and dedicated support make it easy for brokers to provide top-tier coverage. Expand your portfolio, boost client satisfaction, and grow your business with confidence. Join us today and unlock new opportunities!"
    },
    "Employers": {
      "employers": "Employers",
      "rightPlan": "The Right Plan for Employers",
      "protectBusiness": "Protect your business and your team with comprehensive health insurance designed for employers. Our flexible plans offer quality coverage, competitive rates, and essential benefits to keep your employees healthy and productive. Invest in their well-being while enhancing job satisfaction and retention. Get a quote today and build a stronger workplace with the right coverage!"
    },
    "Providers": {
      "providers": "Providers",
      "healthcareProviders": "Healthcare for Providers",
      "empowerHealthSolutions": "Empower your practice with comprehensive healthcare solutions designed for providers. Our tailored plans offer reliable coverage, competitive rates, and essential benefits to support you in delivering quality care. Focus on your patients while we take care of your insurance needs. Get started today and secure the coverage you deserve!"
    },

    "Navbar": {
      "home": "Home",
      "ifp": "Individual And Family Plan",
      "medicare": "Medicare",
      "medicaid": "Medicaid",
      "otherProducts": "Other Products",
      "employers": "Employers",
      "providers": "Providers",
      "brokers": "Brokers"
    }
  }
}
