{
  "TextContent": {
    "Footer": {
      "copyRight": " Generica Health. All rights reserved.",
      "privacy": "Privacy Policy",
      "terms": "Terms of Service",
      "disclaimer": "This is NOT an official medical website. This is a portfolio project to show a fictional product and should not be used for medical purposes. The creator of Generica Health is not responsible for any medical decisions you choose to make. ALWAYS consult with your healthcare provider for healthcare products that might benefit you and your loved ones."
    },
    "Ifp": {
      "ifpTitle": "Individual And Family Plan",
      "findPlans": "Find plans near me:",
      "whatIsIfp": "What is IFP?",
      "ifpDefinition": "IFP stands for Individual and Family Plan, and it is a health insurance plan purchased by individuals or families, typically through:",
      "healthInsMarketplace": "The health insurance marketplace (established by the Affordable Care Act)",
      "DirFromPriInsProv": "Directly from private insurance providers",
      "plansDesigned": "These plans are designed for people who don't have access to employer-sponsored health coverage and provide essential health benefits like doctor visits, hospitalization, prescription drugs, and preventive care.",
      "whosEligible": "Who's eligible?",
      "ifpWithoutEmployer": "Individuals and families without employer sponsored health insurance. Accessible to self-employed individuals, part-time workers, or early retirees.",
      "whatDoesItCover": "What does it cover?",
      "ifpEssentialHealth": "IFPs cover essential health benefits, including:",
      "doctorVisits": "Doctor visits (primary care and specialists)",
      "HosAndEmerCare": "Hospitalization and emergency care",
      "prescriptionDrugs": "Prescription drugs",
      "preventiveCare": "Preventive care (e.g., vaccinations, screenings)",
      "MatAndNewBornCare": "Maternity and newborn care",
      "MentalHealthServices": "Mental health services",
      "pediatricServices": "Pediatric services (including vision and dental for children)",
      "ifpPlanOptions": "What are some plans that IFP offers?",
      "planCategories": "Plans are categorized based on cost-sharing:",
      "bronze": "Bronze: Lower monthly premiums, higher out-of-pocket costs",
      "silver": "Silver: Moderate premiums and out-of-pocket costs",
      "gold": "Gold: Higher premiums, lower out-of-pocket expenses",
      "platinum": "Platinum: Highest premiums, lowest out-of-pocket expenses",
      "personalCost": "How much will it cost me?",
      "costsVary": "Costs vary depending on:",
      "age": "Age",
      "location": "Location",
      "tobaccoUse": "Tobacco use",
      "planCategory": "Plan category",
      "peopleCovered": "Number of people covered",
      "whenCanIEnroll": "When can I enroll?",
      "twoTypesEnrollment": "There's two types of enrollment:",
      "openEnrollment": "Open Enrollment: Occurs annually, typically in the fall",
      "specialEnrollment": "Special Enrollment: Available after qualifying life events (e.g., marriage, birth, job loss)",
      "benefitsOfIfp": "What are some benifits of IFPs?",
      "customizablePlans": "Customizable plans tailored to your healthcare needs",
      "networkOptions": "Nationwide or regional provider network options",
      "comprehensiveCoverage": "Peace of mind with comprehensive coverage",
      "howCanIqualify": "How can I qualify for it?",
      "financialAssistance": "Many people qualify for financial assistance through tax credits or cost-sharing reductions if they purchase through the Marketplace."
    },
    "Medicare": {
      "medicare": "Medicare",
      "findPlans": "Find plans near me:",
      "whatIsMedicare": "What is Medicare?",
      "medicareDescription": "Medicare is a federal health insurance program primarily designed for people aged 65 and older. It also covers certain younger individuals with disabilities or specific health conditions like End-Stage Renal Disease. Medicare provides essential health coverage and is made up of different parts to help cover various aspects of healtchare. These are:",
      "medicarePartA": "Medicare Part A (Hospital Insurance)",
      "coversInpatient": "Covers inpatient hospital care, skilled nursing facility care, hospice, and some home health services.",
      "mostDontPay": "Most people don't pay a premium for Part A if they or their spouse paid Medicare taxes while working.",
      "medicarePartB": "Medicare Part B (Medical Insurance)",
      "coversOutpatient": "Covers outpatient care, doctor visits, preventive services (like screenings and vaccinations), and certain home health services.",
      "partBRequirements": "Part B requires a monthly premium.",
      "medicarePartC": "Medicare Part C (Medicare Advantage)",
      "offeredPrivateIns": "Offered through private insurance companies approved by Medicare.",
      "combinesPartAandB": "Combines coverage from Part A and Part B, and often includes additional benefits like prescription drugs, vision, and dental care.",
      "plansVary": "Plans can vary, but many offer lower out-of-pocket costs and more coverage options.",
      "medicarePartD": "Medicare Part D",
      "helpsCoverCost": "Helps cover the cost of prescription medications.",
      "privateInsAvailability": "Available through private insurers and can be added to Original Medicare (Parts A and B) or included in a Medicare Advantage plan (Part C).",
      "medicarePrivateDifference": "What's the difference between Medicare and a private health insurance?",
      "twoDifferences": "There's two main differences:",
      "eligibility": "Eligibility",
      "medicareAvailability": "Unlike private health insurance, Medicare is available regardless of income but is typically for seniors (65+) or those with certain disabilities.",
      "coverage": "Coverage",
      "standardizedMedicare": "Medicare is standardized by the federal government, whereas private insurance plans can offer a wider range of options and may require additional premiums, copayments, and deductibles.",
      "additionalInformation": "Some additional information",
      "medigap": "Medigap",
      "fillingGaps": "Private insurance that helps fill the gaps in Medicare coverage (e.g., out-of-pocket costs like copayments, coinsurance, and deductibles).",
      "costs": "Costs",
      "medicareManyServices": "While Medicare covers many services, it doesn't pay for everything. Beneficiaries may still have out-of-pocket expenses, including premiums, deductibles, and copayments, depending on the plan."
    }
  }
}
